Revit 2027 API
RebarBarType.GetAutoCalcHookLengths Method
 Identifies if the hook lengths of a hook type are automatically calculated for this bar type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetAutoCalcHookLengths(
	ElementId hookId
)
Public Function GetAutoCalcHookLengths (
	hookId As ElementId
) As Boolean
public:
bool GetAutoCalcHookLengths(
	ElementId^ hookId
)
member GetAutoCalcHookLengths :
        hookId : ElementId -> bool
Parameters
hookId ElementId
 id of the hook type
Return Value
Boolean
 True if the hook lengths are automatically calculated, otherwise false
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace